/*
	1. 求1-100之间的偶数之和
	2. 求1-100之间的奇数之和
	3. 求1-100之间的奇数个数
	4. 求1-100之间的奇数的平均值
 */
# include <stdio.h>

int main(void)
{
	int i;
	int j_sum = 0;  //定义奇数和变量
	int o_sum = 0;  //定义偶数和变量
	int x = 0;  //定义奇数个数变量
	float avg = 0;  //定义奇数平均值变量，可能存在小数，所以使用浮点型

	for (i = 1; i <= 100; ++i)   //方便检验，可以把100换成10
	{
		if (i % 2 == 0)
		{
			o_sum = o_sum + i;  //满足能被2整除，则计算偶数和
		}
		else
		{
			j_sum = j_sum + i;  //不满足被2整除，则计算奇数和
			++x;  //累加奇数和运算的次数，即奇数的个数
		}

		avg = 1.0 * j_sum / x;  //计算奇数的平均值
	}

	printf("1-100之间的偶数和是：%d\n", o_sum);
	printf("1-100之间的奇数和是：%d\n", j_sum);
	printf("1-100之间的奇数个数是：%d\n", x);
	printf("1-100之间的奇数的平均值是：%f\n", avg);

	return 0;
}

/*
在Visual C++6.0中的运行结果
-----------------------
1-100之间的偶数和是：2550
1-100之间的奇数和是：2500
1-100之间的奇数个数是：50
1-100之间的奇数的平均值是：50.000000
Press any key to continue
-----------------------
 */