/*将一个数组中的元素倒置输出*/
# include <stdio.h>

int main(void)
{
	int a[5] = {1, 2, 3, 4, 5};
	int i, j;
	int t;  //用于存放临时数据

	i = 0;
	j = 4;
	while (i < j)
	{
		t = a[i];
		a[i] = a[j];
		a[j] = t;

		++i;  //没有使用到变量自增或自减的整体值，所以i++和++i都可以使用
		--j;
	}
		
	printf("倒置后的数组输出为：");

	for (i = 0; i < 5; ++i)
		printf("%d, ", a[i]);
	printf("\n");	

	return 0;
}

/*
在Visual C++6.0中的运行结果
-----------------------
倒置后的数组输出为：5, 4, 3, 2, 1,
Press any key to continue
-----------------------
 */

/*分析
i = 0
j = 4

0 < 4成立，进入循环

t = a0 = 1
a0 = a4 = 5
a4 = t = 1

i = 1
j = 3

1 < 3成立，进入循环

t = a1 = 2
a1 = a3 = 4
a3 = t = 2

i = 2
j = 2

2 < 2不成立，退出循环

a[5] ={5, 4, 3, 2, 1}  //a[2]值不改变
*/