/*二维数组的表示与输出*/
# include <stdio.h>

int main(void)
{
    int a[3][4] = {
        {1, 2, 3, 4},
        {5, 6, 7, 8},
        {9, 10, 11, 12}
    };

    //也可以如下输入二维数组
    //int a[3][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12};

    int i,j;

    for (i = 0; i < 3; ++i)
    {
    	printf("第 %d 行：", i + 1);
    	for (j = 0; j < 4; ++j)
    	{
    		printf("%-3d", a[i][j]);
    	}
    	printf("\n");
    }

	return 0;
}
/*
在Visual C++6.0中的运行结果
-----------------------
第 1 行：1  2  3  4
第 2 行：5  6  7  8
第 3 行：9  10 11 12
Press any key to continue
-----------------------
 */