/*指针变量&普通变量*/
# include <stdio.h>

int main(void)
{
	int * p;  //指针变量，int *表示的是变量p的数据类型，p是变量名
	int i = 5;
	
	p = &i;  //指针变量指向普通变量
	printf("变量i的值是：%d\n", i);
	printf("变量i存放的地址是：%d\n", &i);  //输出的是变量i存放的地址
	printf("变量p的值是：%d\n", p);  //输出的是变量p的值
	printf("变量p的地址是：%d\n", &p);  //输出变量p存放的地址
	printf("*p的值是：%d\n", *p);  //*p可以替换成i

	i = 3;
	printf("变量i的值是：%d\n", i);
	printf("变量p的值是：%d\n", p);  //修改变量i的值，不影响变量p的值

	*p = 3;  //表示指针变量p指向的值是3
	printf("*p的值是：%d\n", *p);

	return 0;
}
/*
在Visual C++6.0中的运行结果
-----------------------
变量i的值是：5
变量i存放的地址是：1703720
变量p的值是：1703720
变量p的地址是：1703724
*p的值是：5
变量i的值是：3
变量p的值是：1703720
*p的值是：3
Press any key to continue
-----------------------
 */